In [1]:
from io import StringIO
import pandas as pd

In [4]:
strData = """
bad row1 badddd row111
bad row2 badddd row22

id,name,age
01,Roger,17
02,Rosa,23
03,Rob,31
04,Ives,15
bad row3 baddd rowww3
05,Jules,25
"""

In [10]:
def skiprows(x):
    print(x)
    return len(x.split(",") ) != 3

In [59]:
df = pd.read_csv(StringIO(strData), sep = ";", header = None)
df

                        0
0  bad row1 badddd row111
1   bad row2 badddd row22
2             id,name,age
3             01,Roger,17
4              02,Rosa,23
5               03,Rob,31
6              04,Ives,15
7   bad row3 baddd rowww3
8             05,Jules,25

In [20]:
df

                        0
0  bad row1 badddd row111
1   bad row2 badddd row22
2             id,name,age
3             01,Roger,17
4              02,Rosa,23
5               03,Rob,31
6              04,Ives,15
7   bad row3 baddd rowww3
8             05,Jules,25

list

In [43]:
a = df.iloc[:,0].str.split(",")
a

0    [bad row1 badddd row111]
1     [bad row2 badddd row22]
2             [id, name, age]
3             [01, Roger, 17]
4              [02, Rosa, 23]
5               [03, Rob, 31]
6              [04, Ives, 15]
7     [bad row3 baddd rowww3]
8             [05, Jules, 25]
Name: 0, dtype: object

In [23]:
a[a.iloc[:,0].str.len() == 3]

IndexingError: Too many indexers

In [25]:
a

0    [bad row1 badddd row111]
1     [bad row2 badddd row22]
2             [id, name, age]
3             [01, Roger, 17]
4              [02, Rosa, 23]
5               [03, Rob, 31]
6              [04, Ives, 15]
7     [bad row3 baddd rowww3]
8             [05, Jules, 25]
Name: 0, dtype: object

In [41]:
a.to_list()

[['id', 'name', 'age'],
 ['01', 'Roger', '17'],
 ['02', 'Rosa', '23'],
 ['03', 'Rob', '31'],
 ['04', 'Ives', '15'],
 ['05', 'Jules', '25']]

In [57]:
def read_bad_formated_csv(file,ncol, true_sep = ",", false_sep = "\\"):
    df = pd.read_csv(file, sep = false_sep, header = None)
    df = df.iloc[:,0].str.split(true_sep)
    df = [row for row in df if len(row) == ncol]
    df = pd.DataFrame(df[1:], columns = df[0])
    return df

In [60]:
df = read_bad_formated_csv(StringIO(strData), 3)
df

   id   name age
0  01  Roger  17
1  02   Rosa  23
2  03    Rob  31
3  04   Ives  15
4  05  Jules  25

In [67]:
from io import StringIO
import pandas as pd

file = StringIO(
        '''1, 2, 3, 4,
           1, 2
           1, 2, 3, 4, 
           1, 2, 3,''')

df = pd.read_csv(file, usecols =[0,1,2], header = None)
df

   0  1    2
0  1  2  3.0
1  1  2  NaN
2  1  2  3.0
3  1  2  3.0

In [89]:
df = pd.read_excel("unamed1.xlsx")

In [90]:
df

  Unnamed: 0              Unnamed: 1 Unnamed: 2
0        NaN  bad row1 badddd row111        NaN
1      baaaa                     NaN        NaN
2        NaN                     NaN        NaN
3         id                    name        age
4          1                   Roger         17
5          2                    Rosa         23
6          3                     Rob         31
7          4                    Ives         15

In [91]:
first_row = (df.count(axis = 1)  >= df.shape[1]).idxmax()

In [92]:
df.columns = df.loc[first_row]
df = df.loc[first_row+1:]
df

3 id   name age
4  1  Roger  17
5  2   Rosa  23
6  3    Rob  31
7  4   Ives  15